# Задание № 1

# Напишите дешифратор для <<АЗБУКИ МОРЗЕ>> и расшифруйте предоставленную строку:
# -.--.-... .-....---.... ...-.... -.-.-...-..-..--- -...---.-..-..--.-.--.-.-.- ...-.... .---.-.----.. -..-..-.--..-...-.-- ----.-.-...-...-.-..----.-............

morse_dict = {
    'А': '.-', 'Б': '-...', 'В': '.--', 'Г': '--.', 'Д': '-..', 'Е': '.', 'Ё': '.', 'Ж': '...-', 'З': '--..',
    'И': '..', 'Й': '.---', 'К': '-.-', 'Л': '.-..', 'М': '--', 'Н': '-.', 'О': '---', 'П': '.--.', 'Р': '.-.',
    'С': '...', 'Т': '-', 'У': '..-', 'Ф': '..-.', 'Х': '....', 'Ц': '-.-.', 'Ч': '---.', 'Ш': '----', 'Щ': '--.-',
    'Ъ': '-.--.--', 'Ы': '-.--', 'Ь': '-..-', 'Э': '..-..', 'Ю': '..--', 'Я': '.-.-', '0': '-----', '1': '.----',
    '2': '..---', '3': '...--', '4': '....-', '5': '.....', '6': '-....', '7': '--...', '8': '---..', '9': '----.',
    '.': '.-.-.-', ',': '--..--', '?': '..--..', '!': '-.-.--', '-': '-....-', '/': '-..-.', '@': '.--.-.',
    '(': '-.--.', ')': '-.--.-', ':': '---...', ';': '-.-.-.', '=': '-...-', '+': '.-.-.', '_': '..--.-',
    '$': '...-..-', '&': '.-...', '"': '.-..-.', '\'': '.----.'
}


def decodeMorse(morseCode):
    morseCode = morseCode.replace('   ', ' | ')
    morseCodeDict = morseCode.split(' ')
    output = []
    inverted_morse_dict = {value: key for key, value in morse_dict.items()}

    for word in morseCodeDict:
        decoded_word = ''
        for symbol in word.split(' '):
            if symbol in inverted_morse_dict:
                decoded_word += inverted_morse_dict[symbol]
            else:
                while symbol:
                    symbol = symbol[1:]
                    if symbol in inverted_morse_dict:
                        decoded_word += inverted_morse_dict[symbol]
                        break
        output.append(decoded_word)

    return ' '.join(output)


# заданная строка
morse_code_str = '-.--. -.--.- / -.- --- --. -.. .- / -- -.-- / .-. ..- --. .- . -- ... .-.- --..-- / -- -.-- / -.. ..- -- .- . -- / -. .- / .-.- --.. -.-- -.- . / -.. .. -.- --- --. --- / .--. .-.. . -- . -. .. .-.-.- / -.--. -.--.-'

# декодируем строку
decoded_str = decodeMorse(morse_code_str)

# выводим результат
print(decoded_str)
