# Задание № 1

# Напишите дешифратор для <<АЗБУКИ МОРЗЕ>> и расшифруйте предоставленную строку:
# -.--.-... .-....---.... ...-.... -.-.-...-..-..--- -...---.-..-..--.-.--.-.-.- ...-.... .---.-.----.. -..-..-.--..-...-.-- ----.-.-...-...-.-..----.-............

morse_dict = {
    'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.',
    'G': '--.', 'H': '....', 'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..',
    'M': '--', 'N': '-.', 'O': '---', 'P': '.--.', 'Q': '--.-', 'R': '.-.',
    'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
    'Y': '-.--', 'Z': '--..', '0': '-----', '1': '.----', '2': '..---',
    '3': '...--', '4': '....-', '5': '.....', '6': '-....', '7': '--...',
    '8': '---..', '9': '----.'
}


def decode_morse(morse_str, morse_dict):
    decoded = []
    words = morse_str.split(' ')
    for word in words:
        letters = word.split('-')
        for letter in letters:
            if letter and letter in morse_dict.values():
                decoded.append(list(morse_dict.keys())[list(morse_dict.values()).index(letter)])
        decoded.append(' ')
    return ''.join(decoded).strip()


# пример строки для расшифровки
morse_code_str = '-.--.-... .-....---.... ...-.... -.-.-...-..-..--- -...---.-..-..--.-.--.-.-.- ...-.... ' \
                 '.---.-.----.. -..-..-.--..-...-.-- ----.-.-...-...-.-..----.-............'

# дешифруем строку
decoded_str = decode_morse(morse_code_str, morse_dict)

# выводим результат
print(decoded_str)
