# Задание № 1

# Напишите дешифратор для <<АЗБУКИ МОРЗЕ>> и расшифруйте предоставленную строку:
# -.--.-... .-....---.... ...-.... -.-.-...-..-..--- -...---.-..-..--.-.--.-.-.- ...-.... .---.-.----.. -..-..-.--..-...-.-- ----.-.-...-...-.-..----.-............

morse_dict = {
    'А': '.-', 'Б': '-...', 'В': '.--', 'Г': '--.', 'Д': '-..', 'Е': '.', 'Ж': '...-', 'З': '--..', 'И': '..',
    'Й': '.---', 'К': '-.-', 'Л': '.-..', 'М': '--', 'Н': '-.', 'О': '---', 'П': '.--.', 'Р': '.-.', 'С': '...',
    'Т': '-', 'У': '..-', 'Ф': '..-.', 'Х': '....', 'Ц': '-.-.', 'Ч': '---.', 'Ш': '----', 'Щ': '--.-',
    'Ъ': '--.--', 'Ы': '-.--', 'Ь': '-..-', 'Э': '..-..', 'Ю': '..--', 'Я': '.-.-', '0': '-----', '1': '.----',
    '2': '..---', '3': '...--', '4': '....-', '5': '.....', '6': '-....', '7': '--...', '8': '---..', '9': '----.'
}


def decode_morse(morse_str, morse_dict):
    decoded = []
    words = morse_str.split(' ')
    for word in words:
        letters = word.split('-')
        for letter in letters:
            if letter and letter in morse_dict.values():
                decoded.append(list(morse_dict.keys())[list(morse_dict.values()).index(letter)])
        decoded.append(' ')
    return ''.join(decoded).strip()


# заданная строка
morse_code_str = '-.--.-... .-....---.... ...-.... -.-.-...-..-..--- -...---.-..-..--.-.--.-.-.- ...-.... .---.-.----.. -..-..-.--..-...-.-- ----.-.-...-...-.-..----.-............'

# декодируем строку
decoded_str = decode_morse(morse_code_str, morse_dict)

# выводим результат
print(decoded_str)
